cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/completions'
tap 'homebrew/core'
tap 'homebrew/dupes'
tap 'homebrew/php'

tap 'caskroom/cask'
tap 'caskroom/fonts'
tap 'caskroom/versions'
tap 'colindean/fonts-nonfree'
tap 'homebrew/services'
tap 'homebrew/versions'
tap 'osx-cross/avr'
tap 'someposer/mmbd'
tap 'puma/puma'

brew 'coreutils'
brew 'cask'

brew 'bash'
brew 'bash-completion'
brew 'zsh'
brew 'zsh-completions'
brew 'brew-cask-completion'
brew 'grunt-completion'
brew 'maven-completion'
brew 'antigen'

brew 'ack'
brew 'curl'
brew 'gpg'
brew 'gpg-agent'
brew 'grc'
brew 'midnight-commander'
brew 'p7zip'
brew 'readline'
brew 'rsync'
brew 'tree'
brew 'unrar'
brew 'vim'
brew 'wget'
brew 'xz'

brew 'nano'
brew 'emacs'
brew 'multimarkdown'
brew 'ghostscript'
brew 'pandoc'

brew 'imagemagick'
brew 'jp2a'
brew 'jq'
brew 'libcaca', args: ['with-imlib2']

brew 'go'
brew 'node'
brew 'erlang'
brew 'dmd'

brew 'git'
brew 'git-extras'
brew 'git-flow'
brew 'git-fresh'
brew 'git-lfs'
brew 'git-plus'
brew 'git-standup'
brew 'git-subrepo'
brew 'libgit2'
brew 'willgit', args: ['HEAD']
brew 'mercurial'
brew 'subversion'
brew 'arcanist'
cask 'sourcetree'

brew 'openssl'
brew 'openssh'
brew 'openvpn'

brew 'python'
brew 'rbenv'
brew 'ruby-build'
#brew 'puma/puma/puma-dev'

brew 'roundup'
brew 'spaceman-diff'
brew 'spark'
brew 'youtube-dl'

brew 'tidy-html5'

brew 'jenv'
cask 'java6'
cask 'java7'
cask 'java'

brew 'ceylon'
brew 'kotlin'
brew 'scala'

brew 'ant'
brew 'ivy'
brew 'gradle'
brew 'kobalt'
brew 'maven'
brew 'sbt'
cask 'jetbrains-toolbox'
brew 'glassfish'

brew 'android-ndk'
brew 'android-sdk'
cask 'android-studio'

brew 'mosquitto'
brew 'mysql'
brew 'postgresql'
brew 'mongodb'
brew 'libcouchbase'
brew 'sqlite'

brew 'avrdude'
brew 'mono'
brew 'node'
brew 'yarn'

cask 'xquartz'

brew 'faac'
brew 'flac'
brew 'lame'
brew 'two-lame'
brew 'libdvdcss'
brew 'libmmbd'
brew 'mplayer'
brew 'ffmpeg'
brew 'gpac'
cask 'vlc'
brew 'mkvtoolnix'
cask 'air-video-server'
cask 'musicbrainz-picard'
cask 'super-otr'
cask 'waltr'

cask 'alfred'
cask 'bartender'
cask 'blueharvest'
cask 'cinch'
cask 'sizeup'
cask 'a-better-finder-attributes'
cask 'a-better-finder-rename'
cask 'coconutbattery'

cask 'libreoffice'
cask 'microsoft-office'
cask 'atom'
cask 'balsamiq-mockups'
cask 'calibre'
cask 'diffmerge'
cask 'adobe-acrobat'

cask 'iterm2'
cask 'flux'
cask 'firefox'
cask 'google-chrome'
cask 'google-earth'
cask 'handbrake'
cask 'keka'
cask 'mapbox-studio'
cask 'steam'
cask 'tunnelbear'
cask 'fiddler'
cask 'soapui'
cask 'cyberduck'
cask 'darktable'
cask 'gpgtools'
cask 'rawtherapee'
cask 'robomongo'
cask 'skype'
cask 'microsoft-lync'
cask 'synergy'
cask 'tunnelblick'
cask 'whatsize'
cask 'launchcontrol'
cask 'veracrypt'
cask 'virtualbox'
cask 'virtualbox-extension-pack'
cask 'hugin'
cask 'kindle'

cask 'font-microsoft-office'

cask 'font-clear-sans'
cask 'font-coda'
cask 'font-coda-caption'
cask 'font-code'
cask 'font-code2002'
cask 'font-dejavu-sans'
cask 'font-fira-code'
cask 'font-fira-mono'
cask 'font-fira-sans'
cask 'font-hack'
cask 'font-inconsolata'
cask 'font-inconsolata-dz'
cask 'font-inconsolata-g'
cask 'font-inconsolata-lgc'
cask 'font-input'
cask 'font-liberation-sans'
cask 'font-libertinus'
cask 'font-linux-libertine'
cask 'font-m-plus'
cask 'font-noto-color-emoji'
cask 'font-noto-emoji'
cask 'font-noto-sans'
cask 'font-noto-serif'
cask 'font-roboto'
cask 'font-roboto-condensed'
cask 'font-roboto-mono'
cask 'font-source-code-pro'
cask 'font-ubuntu'
